app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `stars`, `shop_id`, `created_at`, `updated_at`) VALUES ('s', 5, 1, '2017-08-10 14:20:38', '2017-08-10 14:20:38')
---
    def create

        @comment = Comment.new
        @comment.content = params[:input_comment]
        @comment.stars = params[:rating]
        @comment.shop_id = params[:shop_id]
        @comment.save