app/controllers/favorites_controller.rb

  def index
    @favorite = Favorite.new(name: params[:favorite_name], shop_id: params[:shop_id])
    @favorite.user_id = current_user.id if current_user
    @favorite.save
---
INSERT INTO "favorites" ("name", "shop_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "CafeArte"], ["shop_id", 1], ["created_at", "2017-08-09 22:59:53.760250"], ["updated_at", "2017-08-09 22:59:53.760250"]]

  def show_favorite
    @show = Favorite.where(user_id: current_user.id)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]

  def destroy
    @favorite = Favorite.find_by_shop_id(params[:shop_id])
    @favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."shop_id" = ? LIMIT 1  [["shop_id", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]