app/controllers/shops_controller.rb

SELECT id, Name, (6371*acos(cos(radians(35.837927799999996))*cos(radians(Latitude))*cos(radians(Longtitude)-radians(128.75227189999998))+sin(radians(35.837927799999996))*sin(radians(Latitude)))) AS Distance FROM `shops` GROUP BY Distance HAVING Distance < 2
---
    def near_shop
        @current_lat = params[:lat]
        @current_lon = params[:long]
        @shop = Shop.select("id, Name, (6371*acos(cos(radians("+@current_lat+"))*cos(radians(Latitude))*cos(radians(Longtitude)-radians("+@current_lon+"))+sin(radians("+@current_lat+"))*sin(radians(Latitude)))) AS Distance").group("Distance").having("Distance < ?", 2)

SELECT `shops`.* FROM `shops`
---
  def select_shop


    @shopname = Shop.all

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."shop_id" = ?  [["shop_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."shop_id" = ?  [["shop_id", 1]]
---
  def show_product
    @selected_shop = Shop.find_by_id(params[:id])
    @products = Product.where(shop_id: params[:id])
    @comments = Comment.where(shop_id: params[:id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def pay
    @selected_product = Product.find_by_id(params[:id])